<a href="https://colab.research.google.com/github/chauhan971/CardioGoodFitness-Analysis/blob/main/Cardio_analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as plt

In [2]:
mydata=pd.read_csv("/content/CardioGoodFitness.csv")

In [5]:
mydata.sample(10)

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
80,TM498,19,Male,14,Single,3,3,31836,64
136,TM498,40,Female,16,Single,3,3,57987,85
29,TM195,25,Female,14,Partnered,2,2,53439,47
34,TM195,26,Female,14,Partnered,3,4,44343,113
87,TM498,23,Male,14,Partnered,3,3,36384,95
35,TM195,26,Female,16,Partnered,4,3,52302,113
48,TM195,28,Male,14,Single,4,3,54576,113
165,TM798,29,Male,18,Single,5,5,52290,180
61,TM195,34,Male,16,Single,4,5,51165,169
98,TM498,25,Female,14,Single,3,4,43206,127

In [4]:
mydata.shape

(180, 9)

In [7]:
mydata.dtypes

Product          object
Age               int64
Gender           object
Education         int64
MaritalStatus    object
Usage             int64
Fitness           int64
Income            int64
Miles             int64
dtype: object

In [8]:
mydata.info

<bound method DataFrame.info of     Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  \
0     TM195   18    Male         14        Single      3        4   29562
1     TM195   19    Male         15        Single      2        3   31836
2     TM195   19  Female         14     Partnered      4        3   30699
3     TM195   19    Male         12        Single      3        3   32973
4     TM195   20    Male         13     Partnered      4        2   35247
..      ...  ...     ...        ...           ...    ...      ...     ...
175   TM798   40    Male         21        Single      6        5   83416
176   TM798   42    Male         18        Single      5        4   89641
177   TM798   45    Male         16        Single      5        5   90886
178   TM798   47    Male         18     Partnered      4        5  104581
179   TM798   48    Male         18     Partnered      4        5   95508

     Miles
0      112
1       75
2       66
3       85
4       47
..     ...
175    200
176    200
177    160
178    120
179    180

[180 rows x 9 columns]>